#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-a2uxbeEF9pfGrAg8

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.storybook.aws_s3_bucket.main: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPFPDKDIM2]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress_passthrough: Refreshing state... [id=default/foreign-language-reader-ingress-passthrough]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/foreign-language-reader-ingress]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=128302476]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["elastic"]: Refreshing state... [id=128302474]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"]: Refreshing state... [id=128302475]
module.infrastructure.module.storybook.aws_s3_bucket_policy.public_access: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.storybook.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1RVJJFB4SD5MG]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.storybook.digitalocean_record.subdomain: Refreshing state... [id=127348002]
module.infrastructure.module.storybook.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/storybook.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.storybook.aws_iam_policy_attachment.deploy: Refreshing state... [id=storybook.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns will be created
  + resource "digitalocean_record" "elastic_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "elastic"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "138.197.239.135"
    }

  # module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns will be created
  + resource "digitalocean_record" "kibana_subdomain_dns" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "kibana"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "138.68.36.15"
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["elastic"] will be destroyed
  - resource "digitalocean_record" "kubernetes_subdomain_dns" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "elastic.foreignlanguagereader.com" -> null
      - id       = "128302474" -> null
      - name     = "elastic" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "159.89.223.61" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["kibana"] will be destroyed
  - resource "digitalocean_record" "kubernetes_subdomain_dns" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "kibana.foreignlanguagereader.com" -> null
      - id       = "128302475" -> null
      - name     = "kibana" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "159.89.223.61" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress_passthrough will be destroyed
  - resource "kubernetes_ingress" "ingress_passthrough" {
      - id                     = "default/foreign-language-reader-ingress-passthrough" -> null
      - load_balancer_ingress  = [
          - {
              - hostname = ""
              - ip       = "159.89.223.61"
            },
        ] -> null
      - wait_for_load_balancer = false -> null

      - metadata {
          - annotations      = {
              - "kubernetes.io/ingress.class"             = "nginx"
              - "nginx.ingress.kubernetes.io/enable-cors" = "true"
            } -> null
          - generation       = 2 -> null
          - labels           = {} -> null
          - name             = "foreign-language-reader-ingress-passthrough" -> null
          - namespace        = "default" -> null
          - resource_version = "2368107" -> null
          - self_link        = "/apis/extensions/v1beta1/namespaces/default/ingresses/foreign-language-reader-ingress-passthrough" -> null
          - uid              = "c7bd0853-8791-4224-b995-70115848233a" -> null
        }

      - spec {

          - rule {
              - host = "elastic.foreignlanguagereader.com" -> null

              - http {
                  - path {
                      - backend {
                          - service_name = "elastic-es-http" -> null
                          - service_port = "9200" -> null
                        }
                    }
                }
            }
          - rule {
              - host = "kibana.foreignlanguagereader.com" -> null

              - http {
                  - path {
                      - backend {
                          - service_name = "kibana-kb-http" -> null
                          - service_port = "5601" -> null
                        }
                    }
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.

Warning: Release does not exist

Release name: spark does not exist. It may have been deleted outside of
Terraform

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
